/*
 * @lc app=leetcode.cn id=36 lang=golang
 * @lcpr version=30401
 *
 * [36] 有效的数独
 */

// @lc code=start
func isValidSudoku(board [][]byte) bool {
	//这题如果不要求算法复杂度,那么只需要分别验证三次即可,即验证每一行,验证每一列,验证每个3×3格子
	//但是显然不能这么做,最好还是一次遍历解决,但是需要通过哈希表来排重,并且需要特殊处理九宫格
	//定义三个排重表,键采用唯一设计,如果在每一行,每一列,每一个宫格都重置map,不太行
	//处理应该比较困难,还是定义有意义的键比较好
	rowMap := make(map[string]bool)
	colMap := make(map[string]bool)
	boxMap := make(map[string]bool)
	//逐一遍历
	for i := 0; i < 9; i++ {
		for j := 0; j < 9; j++ {
			//如果是碰到.则跳过
			if board[i][j] == '.' {
				continue
			}
			num := string(board[i][j])
			//计算九宫格的值
			boxId := i/3*3 + j/3

			//定义行键,列键,格子键
			rowKey := "r" + strconv.Itoa(i) + "_" + num
			colKey := "c" + strconv.Itoa(j) + "_" + num
			boxKey := "b" + strconv.Itoa(boxId) + "_" + num

			if rowMap[rowKey] == true || colMap[colKey] == true || boxMap[boxKey] == true {
				return false
			} else {
				rowMap[rowKey] = true
				colMap[colKey] = true
				boxMap[boxKey] = true
			}
		}
	}
	return true

}
// @lc code=end



/*
// @lcpr case=start
// [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]\n
// @lcpr case=end

// @lcpr case=start
// [["8","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]\n
// @lcpr case=end

 */

